### DataFrames Basic Operations

In [2]:
import numpy as np

import pandas as pd

In [4]:
df1  = pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[10,20,30,40,50],
    'C':[100,200,300,400,500]
})

In [6]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [7]:
df1.shape

(5, 3)

In [8]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [11]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [12]:
df1['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

Applying functions

In [13]:
def square(x):
    return x**2

In [15]:
df1['B'] = df1['B'].apply(square)

In [16]:
df1

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500

In [18]:
df1['D'] = df1['C'].apply(lambda x:x+5)

In [19]:
df1

   A     B    C    D
0  1   100  100  105
1  2   400  200  205
2  3   900  300  305
3  4  1600  400  405
4  5  2500  500  505

### Load Files

CSV File

In [21]:
df = pd.read_csv('anime.csv')
print(df.head()) # Display the first few rows of the DataFrames

   Rank                                              Title  Score
0     1  Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...   9.10
1     2  Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...   9.07
2     3  Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...   9.06
3     4  Gintama°TV (51 eps)Apr 2015 - Mar 2016605,113 ...   9.06
4     5  Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...   9.05

Excel File (.xlsx, .xls)

In [ ]:
df = pd.read_excel("data.xlsx", sheet_name="Sheet1")
print(df.head())

JSON File

In [ ]:
df = pd.read_json("data.json")
print(df.head())

Text File (delimited)

In [ ]:
df = pd.read_csv("data.txt", delimiter="\t")  # for tab-separated values

SQL Database

In [ ]:
import sqlite3

conn = sqlite3.connect("mydb.sqlite")
df = pd.read_sql_query("SELECT * FROM users", conn)

Parquet File

df = pd.read_parquet("data.parquet")